bnb/app/models/user.rb

    def reset_session_token!
        self.update!(session_token: SecureRandom.urlsafe_base64) && self.session_token
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "HOD2fmoq0oe5STSp-Ay4PA"], ["updated_at", "2021-03-11 21:29:21.691224"], ["id", 4]]